; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-37)
(:domain gripper-strips)
(:objects rooma roomb left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 ball36 ball37 )
(:init
(room rooma)
(room roomb)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(ball ball36)
(ball ball37)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 rooma)
(at ball21 rooma)
(at ball22 rooma)
(at ball23 rooma)
(at ball24 rooma)
(at ball25 rooma)
(at ball26 rooma)
(at ball27 rooma)
(at ball28 rooma)
(at ball29 rooma)
(at ball30 rooma)
(at ball31 rooma)
(at ball32 rooma)
(at ball33 rooma)
(at ball34 rooma)
(at ball35 rooma)
(at ball36 rooma)
(at ball37 rooma)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 roomb)
(at ball21 roomb)
(at ball22 roomb)
(at ball23 roomb)
(at ball24 roomb)
(at ball25 roomb)
(at ball26 roomb)
(at ball27 roomb)
(at ball28 roomb)
(at ball29 roomb)
(at ball30 roomb)
(at ball31 roomb)
(at ball32 roomb)
(at ball33 roomb)
(at ball34 roomb)
(at ball35 roomb)
(at ball36 roomb)
(at ball37 roomb)
)
)
)

; plan
1. (pick ball37 rooma left)
   deleted: (at ball37 rooma) (free left)
   added: (carry ball37 left)
   goals met: 19 of 37
2. (pick ball36 rooma right)
   deleted: (at ball36 rooma) (free right)
   added: (carry ball36 right)
   goals met: 19 of 37
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 19 of 37
4. (drop ball36 roomb right)
   deleted: (carry ball36 right)
   added: (at ball36 roomb) (free right)
   goals met: 20 of 37
5. (drop ball37 roomb left)
   deleted: (carry ball37 left)
   added: (at ball37 roomb) (free left)
   goals met: 21 of 37
6. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 21 of 37
7. (pick ball35 rooma left)
   deleted: (at ball35 rooma) (free left)
   added: (carry ball35 left)
   goals met: 21 of 37
8. (pick ball34 rooma right)
   deleted: (at ball34 rooma) (free right)
   added: (carry ball34 right)
   goals met: 21 of 37
9. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 21 of 37
10. (drop ball34 roomb right)
   deleted: (carry ball34 right)
   added: (at ball34 roomb) (free right)
   goals met: 22 of 37
11. (drop ball35 roomb left)
   deleted: (carry ball35 left)
   added: (at ball35 roomb) (free left)
   goals met: 23 of 37
12. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 23 of 37
13. (pick ball33 rooma left)
   deleted: (at ball33 rooma) (free left)
   added: (carry ball33 left)
   goals met: 23 of 37
14. (pick ball32 rooma right)
   deleted: (at ball32 rooma) (free right)
   added: (carry ball32 right)
   goals met: 23 of 37
15. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 23 of 37
16. (drop ball32 roomb right)
   deleted: (carry ball32 right)
   added: (at ball32 roomb) (free right)
   goals met: 24 of 37
17. (drop ball33 roomb left)
   deleted: (carry ball33 left)
   added: (at ball33 roomb) (free left)
   goals met: 25 of 37
18. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 25 of 37
19. (pick ball31 rooma left)
   deleted: (at ball31 rooma) (free left)
   added: (carry ball31 left)
   goals met: 25 of 37
20. (pick ball30 rooma right)
   deleted: (at ball30 rooma) (free right)
   added: (carry ball30 right)
   goals met: 25 of 37
21. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 25 of 37
22. (drop ball30 roomb right)
   deleted: (carry ball30 right)
   added: (at ball30 roomb) (free right)
   goals met: 26 of 37
23. (drop ball31 roomb left)
   deleted: (carry ball31 left)
   added: (at ball31 roomb) (free left)
   goals met: 27 of 37
24. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 27 of 37
25. (pick ball29 rooma left)
   deleted: (at ball29 rooma) (free left)
   added: (carry ball29 left)
   goals met: 27 of 37
26. (pick ball28 rooma right)
   deleted: (at ball28 rooma) (free right)
   added: (carry ball28 right)
   goals met: 27 of 37
27. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 27 of 37
28. (drop ball28 roomb right)
   deleted: (carry ball28 right)
   added: (at ball28 roomb) (free right)
   goals met: 28 of 37
29. (drop ball29 roomb left)
   deleted: (carry ball29 left)
   added: (at ball29 roomb) (free left)
   goals met: 29 of 37
30. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 29 of 37
31. (pick ball27 rooma left)
   deleted: (at ball27 rooma) (free left)
   added: (carry ball27 left)
   goals met: 29 of 37
32. (pick ball26 rooma right)
   deleted: (at ball26 rooma) (free right)
   added: (carry ball26 right)
   goals met: 29 of 37
33. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 29 of 37
34. (drop ball26 roomb right)
   deleted: (carry ball26 right)
   added: (at ball26 roomb) (free right)
   goals met: 30 of 37
35. (drop ball27 roomb left)
   deleted: (carry ball27 left)
   added: (at ball27 roomb) (free left)
   goals met: 31 of 37
36. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 31 of 37
37. (pick ball25 rooma left)
   deleted: (at ball25 rooma) (free left)
   added: (carry ball25 left)
   goals met: 31 of 37
38. (pick ball24 rooma right)
   deleted: (at ball24 rooma) (free right)
   added: (carry ball24 right)
   goals met: 31 of 37
39. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 31 of 37
40. (drop ball24 roomb right)
   deleted: (carry ball24 right)
   added: (at ball24 roomb) (free right)
   goals met: 32 of 37
41. (drop ball25 roomb left)
   deleted: (carry ball25 left)
   added: (at ball25 roomb) (free left)
   goals met: 33 of 37
42. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 33 of 37
43. (pick ball23 rooma left)
   deleted: (at ball23 rooma) (free left)
   added: (carry ball23 left)
   goals met: 33 of 37
44. (pick ball22 rooma right)
   deleted: (at ball22 rooma) (free right)
   added: (carry ball22 right)
   goals met: 33 of 37
45. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 33 of 37
46. (drop ball22 roomb right)
   deleted: (carry ball22 right)
   added: (at ball22 roomb) (free right)
   goals met: 34 of 37
47. (drop ball23 roomb left)
   deleted: (carry ball23 left)
   added: (at ball23 roomb) (free left)
   goals met: 35 of 37
48. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 35 of 37
49. (pick ball21 rooma left)
   deleted: (at ball21 rooma) (free left)
   added: (carry ball21 left)
   goals met: 35 of 37
50. (pick ball20 rooma right)
   deleted: (at ball20 rooma) (free right)
   added: (carry ball20 right)
   goals met: 35 of 37
51. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 35 of 37
52. (drop ball21 roomb left)
   deleted: (carry ball21 left)
   added: (at ball21 roomb) (free left)
   goals met: 36 of 37
53. (drop ball20 roomb right)
   deleted: (carry ball20 right)
   added: (at ball20 roomb) (free right)
   goals met: 37 of 37
